; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph2 - mode
	image3 - mode
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star1 - direction
	Star6 - direction
	Star3 - direction
	Star4 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star1)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(have_image Star8 infrared0)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 infrared0)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 image3)
	(have_image Phenomenon14 thermograph1)
	(have_image Planet15 image3)
))

)

; plan
1. (turn_to satellite1 star3 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star3)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon14 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon14 instrument3 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 9
7. (turn_to satellite0 star1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star1)
   goals met: 1 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
9. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 9
10. (take_image satellite1 phenomenon12 instrument3 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 2 of 9
11. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 9
12. (take_image satellite0 phenomenon9 instrument0 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 3 of 9
13. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 3 of 9
14. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 4 of 9
15. (turn_to satellite0 planet15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet15)
   goals met: 4 of 9
16. (take_image satellite0 planet15 instrument0 image3)
   added: (have_image planet15 image3)
   goals met: 5 of 9
17. (turn_to satellite0 star11 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star11)
   goals met: 5 of 9
18. (take_image satellite0 star11 instrument0 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 6 of 9
19. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 6 of 9
20. (take_image satellite0 star13 instrument0 image3)
   added: (have_image star13 image3)
   goals met: 7 of 9
21. (turn_to satellite0 phenomenon12 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon12)
   goals met: 8 of 9
22. (turn_to satellite1 star8 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star8)
   goals met: 8 of 9
23. (take_image satellite1 star8 instrument3 infrared0)
   added: (have_image star8 infrared0)
   goals met: 9 of 9
